[
  {
    "title" : "Recipe Look Up",
    "description" : "Recipe Look Up was made for a game called 'Dont Starve' by 'Klei Entertainment'. I wanted to provide users a way to quickly look up food recipes while in game. One feature I'm very happy about is real time search results. It allows for searching dish recipes in real time.",
    "tools" : ["Javascript", "React", "S(CSS)", "HTML5", "JSON"],
    "demo_href" : "https://liamortiz.github.io/dst-quicklookup/",
    "code_href" : "https://github.com/liamortiz/dst-quicklookup"
  },
  {
    "title" : "Book Corner",
    "description" : "This is a Full Stack web application using PostgresSQL, Rails, Ruby and Javascript. It uses the Google Books API and allows users to browse, favorite and leave reviews on real books. It's slightly optimized for mobile view and uses best security practices when creating accounts.",
    "tools" : ["Javascript", "PostgresSQL", "Google API", "Ruby", "Rails", "S(CSS)", "HTML5"],
    "demo_href" : "https://the-book-corner.herokuapp.com/",
    "code_href" : "https://github.com/liamortiz/book-corner"
  },
  {
    "title" : "3D Model Extractor",
    "description" : "I built this for the modding community. It essentially scrapes asset data for a Donkey Kong game and decompresses/re-arranges it into 3D Models. It was entirely made with Python with a strong understanding of how to handle raw binary data.",
    "tools" : ["Python"],
    "demo_href" : "",
    "code_href" : "https://github.com/leamsii/DK-Tropical-Freeze-Model-Extractor"
  },
  {
    "title" : "Spotify CLI Program",
    "description" : "This is a small CLI Program using the Spotify API. The user is able to login or create an account, create playlist and add songs to their playlist. They're able to backup the playlist to a database and every song gets pulled from the API into the database.",
    "tools" : ["Ruby", "SQLite", "Spotify API", "Active Record"],
    "demo_href" : "",
    "code_href" : "https://github.com/liamortiz/spotify-cli-program"
  },
  {
    "title" : "My Portfolio",
    "description" : "I made this during my time at Flatiron School on the side while also working on school assignments. I wanted to provide a way for future recruiters to efficiently view my project history, skills, and some information about me.",
    "tools" : ["Typescript", "React", "S(CSS)", "HTML5", "JSON"],
    "demo_href" : "",
    "code_href" : "https://github.com/liamortiz/portfolio"
  }
]
