[
  {
    "title" : "Green Paws eCommerce",
    "description" : "This is an all dogs eCommerce website. Some features include product filtering and sorting. Users can create an account and browse through the hundreds of products the store has. The database was seeded with a small Python bot that scrapes other online stores and extracts their products information.",
    "tools" : ["React", "Redux", "Ruby", "Rails", "PostgreSQL", "Cloudinary", "S(CSS)", "HTML5"],
    "demo_href" : "https://greenpawsv13.web.app/",
    "code_href" : "https://github.com/liamortiz/greenpaws"
  },
  {
    "title" : "Algorithm Imager",
    "description" : "I wanted to dive into how some common algorithms worked and demonstrate their behavior through some form of visualization. Using common algorithms like Depth-first search, Breadth-first search, Merge Sort and Quicksort I created unique visualizations combined with JPEG Images.",
    "tools" : ["Javascript", "React", "S(CSS)", "HTML5"],
    "demo_href" : "https://mayalexandera.github.io/AlgI/",
    "code_href" : "https://github.com/mayalexandera/AlgI"
  },
  {
    "title" : "Python 3D Model Extractor",
    "description" : "This essentially takes in raw binary data from compressed encrypted files and decompresses them into 3D models. It was entirely made with Python with a strong understanding of how to handle binary data and different compression algorithms.",
    "tools" : ["Python"],
    "demo_href" :  "",
    "code_href" : "https://github.com/leamsii/DK-Tropical-Freeze-Model-Extractor"
  },
  {
    "title" : "Recipe Look Up",
    "description" : "Recipe Look Up was made for a game called 'Dont Starve' by 'Klei Entertainment'. I wanted to provide users a way to quickly look up food recipes while in game. One feature I'm very happy about is real time search results. It allows for searching dish recipes in real time.",
    "tools" : ["Javascript", "React", "S(CSS)", "HTML5", "JSON"],
    "demo_href" : "https://liamortiz.github.io/dst-quicklookup/",
    "code_href" : "https://github.com/liamortiz/dst-quicklookup"
  },
  {
    "title" : "Book Corner",
    "description" : "This is a Full Stack web application using PostgresSQL, Rails, Ruby and Javascript. It uses the Google Books API and allows users to browse, favorite and leave reviews on real books. It's slightly optimized for mobile view and uses best security practices when creating accounts.",
    "tools" : ["Javascript", "PostgresSQL", "Google API", "Ruby", "Rails", "S(CSS)", "HTML5"],
    "demo_href" : "https://the-book-corner.herokuapp.com/",
    "code_href" : "https://github.com/liamortiz/book-corner"
  },
  {
    "title" : "Spotify CLI Program",
    "description" : "This is a small CLI Program using the Spotify API. The user is able to login or create an account, create playlist and add songs to their playlist. They're able to backup the playlist to a database and every song gets pulled from the API into the database.",
    "tools" : ["Ruby", "SQLite", "Spotify API", "Active Record"],
    "demo_href" : "",
    "code_href" : "https://github.com/liamortiz/spotify-cli-program"
  },
  {
    "title" : "My Portfolio",
    "description" : "This is my personal portfolio, made with TypeScript. I wanted to provide a way for people to view my projects, skills, and learn about who I am.",
    "tools" : ["Typescript", "React", "S(CSS)", "HTML5", "JSON"],
    "demo_href" : "",
    "code_href" : "https://github.com/liamortiz/portfolio"
  }
]
